app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.creator_id = current_user.id
    @event.save
---
INSERT INTO "events" ("creator_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["creator_id", 5], ["created_at", "2018-02-08 19:19:11.432735"], ["updated_at", "2018-02-08 19:19:11.432735"]]

  def subscribe
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def invite
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def invfriend
    @event = Event.find(params[:id])
    @event.attendees << User.find(params[:friend])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]