app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "seg"], ["email", "seg@yopmail.com"], ["password", "segseg"], ["created_at", "2018-02-08 16:13:11.822636"], ["updated_at", "2018-02-08 16:13:11.822636"]]
---
  def create
    @user = User.new(user_params)
    if @user.save